Revit 2027 API
BuiltInFailures.ElectricalFailures.NoAvailableMatchingConnector Property
 Cannot add [Element] to Circuit. There is no available connector matching the Type ([Type Name]) for the Circuit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoAvailableMatchingConnector { get; }
Public Shared ReadOnly Property NoAvailableMatchingConnector As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoAvailableMatchingConnector {
	FailureDefinitionId^ get ();
}
static member NoAvailableMatchingConnector : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace